#!/usr/bin/perl

open IN,"<$ARGV[0]"; @_=<IN>; close IN;
$c=0;
for(@_){
	s/^[ \t]+//; # 去掉头部空白
	s/[ \t]+$//; # 去掉尾部空白
	s/\r//;
	s/([\)])\s*/$1/g; # 括号后不留空
	s/\s*([\(\{]+)/ $1/g; # 括号前留空
	s/\s*([=!~]+)\s*/ $1 /g; # 等式2边一空格
	s/(?!^)[ \t]*#\s*(.*?)$/\t\t# $1/; # 注释
	s/\*\s*([\(\)])/*$1/g; # 指针紧挨()
	$_="\t"x$c.$_;
	#s/(?<!if)\ \(.*?\)/(-)/sg; # 非if的括号内容清空
	$c++ if /\{/;
	$c-- if /\}/;
}
$_=join "",@_;
s/(\([^\(\)]*)\n\s*([^\n]*\);\n)/$1~~~$2/g; # 合并分行的函数()
s/\n\s*\{/\{/g; # { 不新行
s/\t\}/\}/g; # } 回退一格
print;
